In [1]:
import pandas as pd

In [4]:
data = {
    'a' : [1,2,3,4],
    'b' : [4,5,6,7],
    'c' : ['nabin','cyrolux','sabin','bipin']
}

In [5]:
df = pd.DataFrame(data)

In [6]:
df

   a  b        c
0  1  4    nabin
1  2  5  cyrolux
2  3  6    sabin
3  4  7    bipin

In [9]:
df.set_index('a',inplace = True)

In [10]:
df

   b        c
a
1  4    nabin
2  5  cyrolux
3  6    sabin
4  7    bipin

In [11]:
df.reset_index()

   a  b        c
0  1  4    nabin
1  2  5  cyrolux
2  3  6    sabin
3  4  7    bipin

In [12]:
df

   b        c
a
1  4    nabin
2  5  cyrolux
3  6    sabin
4  7    bipin

In [13]:
df.reset_index(inplace = True)
#df = df.reset_index()

In [14]:
df

   a  b        c
0  1  4    nabin
1  2  5  cyrolux
2  3  6    sabin
3  4  7    bipin

In [16]:
data = {
    'a' : [1,2,3,4],
    'b' : [4,5,6,7],
    'c' : ['nabin','cyrolux','sabin','bipin']
}
df1 = pd.DataFrame(data,index = ['a','b','c','d'])

In [17]:
df1

   a  b        c
a  1  4    nabin
b  2  5  cyrolux
c  3  6    sabin
d  4  7    bipin

In [18]:
df1.reindex(['b','c','d','a'])

   a  b        c
b  2  5  cyrolux
c  3  6    sabin
d  4  7    bipin
a  1  4    nabin

In [19]:
df1

   a  b        c
a  1  4    nabin
b  2  5  cyrolux
c  3  6    sabin
d  4  7    bipin

In [23]:
for i,j in df1.iterrows():
    print(i,j)

a a        1
b        4
c    nabin
Name: a, dtype: object
b a          2
b          5
c    cyrolux
Name: b, dtype: object
c a        3
b        6
c    sabin
Name: c, dtype: object
d a        4
b        7
c    bipin
Name: d, dtype: object

In [26]:
df['a']

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [29]:
list(df['a'])

[1, 2, 3, 4]

In [28]:
print([i for i in df['a']])

[1, 2, 3, 4]

In [30]:
df1

   a  b        c
a  1  4    nabin
b  2  5  cyrolux
c  3  6    sabin
d  4  7    bipin

In [31]:
def test(x):
    return x.sum()
df1.apply(test)

a                        10
b                        22
c    nabincyroluxsabinbipin
dtype: object

In [33]:
def test(x):
    return x.sum()
df1.apply(test,axis = 0)

a                        10
b                        22
c    nabincyroluxsabinbipin
dtype: object

In [34]:
df1

   a  b        c
a  1  4    nabin
b  2  5  cyrolux
c  3  6    sabin
d  4  7    bipin

In [36]:
df2 = df1[['a','b']]

In [37]:
df2

   a  b
a  1  4
b  2  5
c  3  6
d  4  7

In [39]:
df2.map(lambda x : x**2)

    a   b
a   1  16
b   4  25
c   9  36
d  16  49

In [40]:
df1

   a  b        c
a  1  4    nabin
b  2  5  cyrolux
c  3  6    sabin
d  4  7    bipin

In [41]:
df

   a  b        c
0  1  4    nabin
1  2  5  cyrolux
2  3  6    sabin
3  4  7    bipin

In [42]:
df.sort_values('c')

   a  b        c
3  4  7    bipin
1  2  5  cyrolux
0  1  4    nabin
2  3  6    sabin

In [44]:
df.sort_index(ascending = False)

   a  b        c
3  4  7    bipin
2  3  6    sabin
1  2  5  cyrolux
0  1  4    nabin

In [54]:
pd.set_option('display.max_colwidth', 1000)
df3 = pd.DataFrame({'Desc' : ['Data science is the study of data to extract meaningful insights for business. It is a multidisciplinary approach that combines principles and practices from the fields of mathematics, statistics, artificial intelligence, and computer engineering to analyze large amounts of data. This analysis helps data scientists to ask and answer questions like what happened, why it happened, what will happen, and what can be done with the results','my name is nabin','i am a student']})

In [55]:
df3

                                                                                                                                                                                                                                                                                                                                                                                                                                                    Desc
0  Data science is the study of data to extract meaningful insights for business. It is a multidisciplinary approach that combines principles and practices from the fields of mathematics, statistics, artificial intelligence, and computer engineering to analyze large amounts of data. This analysis helps data scientists to ask and answer questions like what happened, why it happened, what will happen, and what can be done with the results
1                                                                                                                                                                                                                                                                                                                                                                                                                                       my name is nabin
2                                                                                                                                                                                                                                                                                                                                                                                                                                         i am a student

In [58]:
df3['len'] = df3['Desc'].apply(len)

In [59]:
df3

,Desc,len
0,"Data science is the study of data to extract meaningful insights for business. It is a multidisciplinary approach that combines principles and practices from the fields of mathematics, statistics, artificial intelligence, and computer engineering to analyze large amounts of data. This analysis helps data scientists to ask and answer questions like what happened, why it happened, what will happen, and what can be done with the results",437
1,my name is nabin,16
2,i am a student,14

In [63]:
t = ' i am a student'
len(t.split())

4

In [65]:
df3['word_count'] = df3['Desc'].apply(lambda x : len(x.split()))

In [66]:
df3

,Desc,len,word_count
0,"Data science is the study of data to extract meaningful insights for business. It is a multidisciplinary approach that combines principles and practices from the fields of mathematics, statistics, artificial intelligence, and computer engineering to analyze large amounts of data. This analysis helps data scientists to ask and answer questions like what happened, why it happened, what will happen, and what can be done with the results",437,67
1,my name is nabin,16,4
2,i am a student,14,4

In [67]:
df

   a  b        c
0  1  4    nabin
1  2  5  cyrolux
2  3  6    sabin
3  4  7    bipin

In [68]:
df['a']

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [69]:
df[['a']]

   a
0  1
1  2
2  3
3  4

In [70]:
df['a'][0]

1

In [71]:
df

   a  b        c
0  1  4    nabin
1  2  5  cyrolux
2  3  6    sabin
3  4  7    bipin

In [72]:
df['a'].mean()

2.5

In [73]:
df['a'].median()

2.5

In [74]:
df['a'].mode()

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [75]:
df['a'].std()

1.2909944487358056

In [76]:
df['a'].sum()

10

In [77]:
df['a'].min()

1

In [79]:
df['a'].max()

4

In [80]:
df['a'].var()

1.6666666666666667

In [83]:
#Python Pandas - Window Functions
df4 = pd.DataFrame({'a' : [3,4,5,2,1,3,4,5,6]})

In [84]:
df4

   a
0  3
1  4
2  5
3  2
4  1
5  3
6  4
7  5
8  6

In [87]:
df4['a'].rolling(window = 1).mean()

0    3.0
1    4.0
2    5.0
3    2.0
4    1.0
5    3.0
6    4.0
7    5.0
8    6.0
Name: a, dtype: float64

In [88]:
df4['a'].rolling(window = 2).mean()

0    NaN
1    3.5
2    4.5
3    3.5
4    1.5
5    2.0
6    3.5
7    4.5
8    5.5
Name: a, dtype: float64

In [89]:
df4['a'].rolling(window = 3).mean()

0         NaN
1         NaN
2    4.000000
3    3.666667
4    2.666667
5    2.000000
6    2.666667
7    4.000000
8    5.000000
Name: a, dtype: float64

In [90]:
df4

   a
0  3
1  4
2  5
3  2
4  1
5  3
6  4
7  5
8  6

In [91]:
df4['a'].rolling(window = 3).sum()

0     NaN
1     NaN
2    12.0
3    11.0
4     8.0
5     6.0
6     8.0
7    12.0
8    15.0
Name: a, dtype: float64

In [92]:
df4['a'].rolling(window = 2).min()

0    NaN
1    3.0
2    4.0
3    2.0
4    1.0
5    1.0
6    3.0
7    4.0
8    5.0
Name: a, dtype: float64

In [93]:
df4['a'].rolling(window = 2).max()

0    NaN
1    4.0
2    5.0
3    5.0
4    2.0
5    3.0
6    4.0
7    5.0
8    6.0
Name: a, dtype: float64

In [94]:
df4['a'].cumsum()

0     3
1     7
2    12
3    14
4    15
5    18
6    22
7    27
8    33
Name: a, dtype: int64

In [95]:
df4

   a
0  3
1  4
2  5
3  2
4  1
5  3
6  4
7  5
8  6

In [99]:
#Python Pandas - Date Functionality

date = pd.date_range(start = '2023-04-23', end = '2023-06-23')

In [100]:
date

DatetimeIndex(['2023-04-23', '2023-04-24', '2023-04-25', '2023-04-26',
               '2023-04-27', '2023-04-28', '2023-04-29', '2023-04-30',
               '2023-05-01', '2023-05-02', '2023-05-03', '2023-05-04',
               '2023-05-05', '2023-05-06', '2023-05-07', '2023-05-08',
               '2023-05-09', '2023-05-10', '2023-05-11', '2023-05-12',
               '2023-05-13', '2023-05-14', '2023-05-15', '2023-05-16',
               '2023-05-17', '2023-05-18', '2023-05-19', '2023-05-20',
               '2023-05-21', '2023-05-22', '2023-05-23', '2023-05-24',
               '2023-05-25', '2023-05-26', '2023-05-27', '2023-05-28',
               '2023-05-29', '2023-05-30', '2023-05-31', '2023-06-01',
               '2023-06-02', '2023-06-03', '2023-06-04', '2023-06-05',
               '2023-06-06', '2023-06-07', '2023-06-08', '2023-06-09',
               '2023-06-10', '2023-06-11', '2023-06-12', '2023-06-13',
               '2023-06-14', '2023-06-15', '2023-06-16', '2023-06-17',
               '2023-06-18', '2023-06-19', '2023-06-20', '2023-06-21',
               '2023-06-22', '2023-06-23'],
              dtype='datetime64[ns]', freq='D')

In [3]:
df_date = pd.DataFrame({'date' : date})

NameError: name 'pd' is not defined

In [2]:
df_date.dtypes

NameError: name 'df_date' is not defined

In [102]:
df_date

         date
0  2023-04-23
1  2023-04-24
2  2023-04-25
3  2023-04-26
4  2023-04-27
..        ...
57 2023-06-19
58 2023-06-20
59 2023-06-21
60 2023-06-22
61 2023-06-23

[62 rows x 1 columns]

In [105]:
df7 = pd.DataFrame({'date' :['2023-06-23', '2023-06-22','2023-06020']})

In [106]:
df7

         date
0  2023-06-23
1  2023-06-22
2  2023-06020

In [1]:
df7.dtype

NameError: name 'df7' is not defined